# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [57]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [58]:
first = pd.Series(np.random.randint(1,5, 100))
second = pd.Series(np.random.randint(1, 4, 100))
third = pd.Series(np.random.randint(10000,30001, 100))
print(first)
print(second)
print(third)

0     3
1     4
2     1
3     1
4     2
     ..
95    4
96    3
97    4
98    2
99    1
Length: 100, dtype: int64
0     1
1     2
2     2
3     3
4     1
     ..
95    1
96    2
97    1
98    3
99    3
Length: 100, dtype: int64
0     25858
1     16677
2     28495
3     14890
4     11943
      ...
95    18975
96    12611
97    17653
98    28316
99    18570
Length: 100, dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [59]:
df = pd.concat([first, second, third], axis=1)
df.head()

   0  1      2
0  3  1  25858
1  4  2  16677
2  1  2  28495
3  1  3  14890
4  2  1  11943

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [60]:
df = df.rename({0: "bedrs", 1: "bathrs", 2: "price_sql_meter"}, axis=1)
df.head()

   bedrs  bathrs  price_sql_meter
0      3       1            25858
1      4       2            16677
2      1       2            28495
3      1       3            14890
4      2       1            11943

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [65]:
bigColumn = pd.concat([first, second, third], axis=0)
print(bigColumn.shape[0])
bigColumn

300

0         3
1         4
2         1
3         1
4         2
      ...
95    18975
96    12611
97    17653
98    28316
99    18570
Length: 300, dtype: int64

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [ ]:
# yep

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [66]:
bigColumn.reset_index()

     index      0
0        0      3
1        1      4
2        2      1
3        3      1
4        4      2
..     ...    ...
295     95  18975
296     96  12611
297     97  17653
298     98  28316
299     99  18570

[300 rows x 2 columns]